In [3]:
import pandas as pd
df = pd.read_csv('datasets/groupbydata2.csv')
df.head()

         date    city  temperature  humidity
0  01/01/2022  lahore            8        60
1  02/01/2022  lahore           10        58
2  03/01/2022  lahore            5        51
3  04/01/2022  lahore            6        49
4  05/01/2022  lahore           12        54

In [4]:
df.shape

(15, 4)

In [5]:
df[df.city == 'lahore'].temperature.min()

5

In [6]:
df.loc[df['city'] == 'karachi'].temperature.max()

18

In [9]:
df.mean(numeric_only = True)

temperature     6.133333
humidity       64.933333
dtype: float64

In [11]:
df.count()

date           15
city           15
temperature    15
humidity       15
dtype: int64

In [12]:
df.agg(['min', 'max', 'mean'])

/tmp/ipykernel_36490/497501168.py:1: FutureWarning: ['date', 'city'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  df.agg(['min', 'max', 'mean'])

            date     city  temperature   humidity
min   01/01/2022  karachi    -7.000000  49.000000
max   05/01/2022   murree    18.000000  78.000000
mean         NaN      NaN     6.133333  64.933333

In [13]:
df.temperature.min()

-7

In [14]:
df.temperature.agg(['min', 'max', 'mean'])

min     -7.000000
max     18.000000
mean     6.133333
Name: temperature, dtype: float64

In [16]:
def ctof(x):
    return x*(9/5) + 32
df.temperature.apply(ctof)

0     46.4
1     50.0
2     41.0
3     42.8
4     53.6
5     64.4
6     50.0
7     53.6
8     59.0
9     60.8
10    23.0
11    26.6
12    24.8
13    30.2
14    19.4
Name: temperature, dtype: float64

In [17]:
df.temperature.apply(lambda x: x*(9/5) + 32)

0     46.4
1     50.0
2     41.0
3     42.8
4     53.6
5     64.4
6     50.0
7     53.6
8     59.0
9     60.8
10    23.0
11    26.6
12    24.8
13    30.2
14    19.4
Name: temperature, dtype: float64

In [23]:
lhr = df[df.city == 'lahore'].temperature.min()

khi = df[df.city == 'karachi'].temperature.min()

mur = df[df.city == 'murree'].temperature.min()

In [28]:
ser = pd.Series(data = [lhr, khi, mur], name = 'min temp', index = ['lhr_min', 'khi_min', 
                                                                   'mur_min'])
ser

lhr_min     5
khi_min    10
mur_min    -7
Name: min temp, dtype: int64

In [31]:
df.temperature.min()

-7

In [36]:
dfgb = df.groupby(df['city'])
dfgb

In [37]:
dfgb.groups

{'karachi': [5, 6, 7, 8, 9], 'lahore': [0, 1, 2, 3, 4], 'murree': [10, 11, 12, 13, 14]}

In [38]:
dfgb.get_group('lahore')

         date    city  temperature  humidity
0  01/01/2022  lahore            8        60
1  02/01/2022  lahore           10        58
2  03/01/2022  lahore            5        51
3  04/01/2022  lahore            6        49
4  05/01/2022  lahore           12        54

In [39]:
dfgb.size()

city
karachi    5
lahore     5
murree     5
dtype: int64

In [45]:
dfgb_min = dfgb.temperature.min()
dfgb_min.name = 'Min Temperature'
#type(dfgb_min)
dfgb_min

city
karachi    10
lahore      5
murree     -7
Name: Min Temperature, dtype: int64

In [46]:
import pandas as pd
df = pd.read_csv('datasets/so_survey_subset.csv', index_col='Respondent')
df.shape

(88883, 9)

In [50]:
df.loc[df['Country']=='Pakistan',:]

,MainBranch,Hobbyist,Country,YearsCode,ConvertedComp,LanguageWorkedWith,SocialMedia,Age,Gender
Respondent,,,,,,,,,
84,I am a developer by profession,No,Pakistan,3,3468.0,C;C++;C#;Java;Kotlin;PHP;SQL,WhatsApp,26.0,Man
119,I am a developer by profession,No,Pakistan,10,NaN,C;C++;C#;HTML/CSS;Java;JavaScript;SQL,Facebook,28.0,Man
298,I am a developer by profession,Yes,Pakistan,4,NaN,HTML/CSS;JavaScript;PHP;SQL;Other(s):,LinkedIn,23.0,Man
299,I am a developer by profession,Yes,Pakistan,19,NaN,Assembly;C;C++;Java;Python;SQL,Facebook,25.0,Man
311,I am a developer by profession,No,Pakistan,5,2600.0,Assembly;C;C++;C#;HTML/CSS;Java;Python;Scala;SQL,LinkedIn,24.0,Man
...,...,...,...,...,...,...,...,...,...
88862,I am a student who is learning to code,Yes,Pakistan,3,NaN,Java,WhatsApp,21.0,Man
5439,NaN,Yes,Pakistan,2,NaN,NaN,Instagram,24.0,Woman
39117,NaN,Yes,Pakistan,4,NaN,C;C++;C#;HTML/CSS;Java;JavaScript;SQL,WhatsApp,22.0,Man
60066,NaN,Yes,Pakistan,4,NaN,Assembly;C++;C#;HTML/CSS;Java;PHP;Python;SQL,YouTube,20.0,Man
88182,NaN,Yes,Pakistan,1,NaN,HTML/CSS;Java;JavaScript,Twitter,NaN,Man

In [55]:
df.LanguageWorkedWith.count()

87569

In [57]:
dfgb = df.groupby('Country')

In [59]:
dfx = dfgb.SocialMedia.value_counts()

In [60]:
dfx.Pakistan

SocialMedia
WhatsApp                    266
Facebook                    232
YouTube                     182
LinkedIn                     71
Twitter                      58
Instagram                    41
Reddit                       28
I don't use social media     23
Snapchat                      5
Hello                         1
VK ВКонта́кте                 1
Name: SocialMedia, dtype: int64

In [61]:
dfx.loc['Pakistan',:]

SocialMedia
WhatsApp                    266
Facebook                    232
YouTube                     182
LinkedIn                     71
Twitter                      58
Instagram                    41
Reddit                       28
I don't use social media     23
Snapchat                      5
Hello                         1
VK ВКонта́кте                 1
Name: SocialMedia, dtype: int64

In [103]:
#option 1
tc = df.loc[:,'Country'].value_counts()
tc.name = 'Total'

In [104]:
tc1 = df.groupby('Country')['Country'].apply(lambda x: x.value_counts())
tc1.name = 'Total'
tc1

Country
Afghanistan                           Afghanistan                              44
Albania                               Albania                                  86
Algeria                               Algeria                                 134
Andorra                               Andorra                                   7
Angola                                Angola                                    5
                                                                             ...
Venezuela, Bolivarian Republic of...  Venezuela, Bolivarian Republic of...     88
Viet Nam                              Viet Nam                                231
Yemen                                 Yemen                                    19
Zambia                                Zambia                                   12
Zimbabwe                              Zimbabwe                                 39
Name: Total, Length: 179, dtype: int64

In [105]:
tc

United States        20949
India                 9061
Germany               5866
United Kingdom        5737
Canada                3395
                     ...
Tonga                    1
Timor-Leste              1
North Korea              1
Brunei Darussalam        1
Chad                     1
Name: Total, Length: 179, dtype: int64

In [111]:
#pc = df.groupby('Country')['LanguageWorkedWith'].apply(lambda x: x.str.contains('Python').sum())
#pc

Country
Afghanistan                              8
Albania                                 23
Algeria                                 40
Andorra                                  0
Angola                                   2
                                        ..
Venezuela, Bolivarian Republic of...    28
Viet Nam                                78
Yemen                                    3
Zambia                                   4
Zimbabwe                                14
Name: LanguageWorkedWith, Length: 179, dtype: int64

In [112]:
dfgb = df.groupby('Country')
pc = dfgb.LanguageWorkedWith.apply(lambda x: x.str.contains('Python').sum())
pc.name = 'python developer'
pc

Country
Afghanistan                              8
Albania                                 23
Algeria                                 40
Andorra                                  0
Angola                                   2
                                        ..
Venezuela, Bolivarian Republic of...    28
Viet Nam                                78
Yemen                                    3
Zambia                                   4
Zimbabwe                                14
Name: python developer, Length: 179, dtype: int64

In [114]:
result = pd.concat([tc,pc], axis = 1)
result

                   Total  python developer
United States      20949             10083
India               9061              3105
Germany             5866              2451
United Kingdom      5737              2384
Canada              3395              1558
...                  ...               ...
Tonga                  1                 0
Timor-Leste            1                 1
North Korea            1                 0
Brunei Darussalam      1                 0
Chad                   1                 0

[179 rows x 2 columns]

In [119]:
result['Percentage'] = (result['python developer'] / result['Total']) * 100
result

                   Total  python developer  Percentage
United States      20949             10083   48.131176
India               9061              3105   34.267741
Germany             5866              2451   41.783157
United Kingdom      5737              2384   41.554820
Canada              3395              1558   45.891016
...                  ...               ...         ...
Tonga                  1                 0    0.000000
Timor-Leste            1                 1  100.000000
North Korea            1                 0    0.000000
Brunei Darussalam      1                 0    0.000000
Chad                   1                 0    0.000000

[179 rows x 3 columns]

In [120]:
result.loc['Pakistan']

Total               923.000000
python developer    251.000000
Percentage           27.193933
Name: Pakistan, dtype: float64